/*
Завдання:
Необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу):
на першому рядку - одна зірочка, на другій дві, і так далі. Рішення оформіть у вигляді функції, куди передаються
два параметри: висота трикутника та символ, яким його потрібно "малювати".
Умови виконання:
- роботу необхідно виконати двома способами
*/

// Перший спосіб

function drawTriangle(height, symbol) {
    for (let i = 1; i <= height; i++) {
        let row = '';
        for (let j = 1; j <= i; j++) {
            row += symbol;
        }
        console.log(row)
    }
}
drawTriangle(10, '#')


// Другий спосіб

function drawTriangle(height, symbol) {
    let i = 1;
    while (i <= height) {
        let row = ''; // Ініціалізуємо порожній рядок
        let j = 1;
        while (j <= i) {
            row += symbol; // Додаємо символ до рядка
            j++;
        }
        console.log(row); // Виводимо рядок на консоль
        i++;
    }
}
drawTriangle(10, '*');

