/*
Необхідно написати програму, яка буде виводити інформацію за умовами, при яких число виводитиметься
з правильним словом: "рік", "роки" або "років". Тобто. "29 років" чи "4 роки".

Умови виконання:
- Рік отримувати через prompt()
- Зробити перевірку що користувачь ввів число та це число не є від`ємним
 */


let age = prompt("Введіть ваш вік");
let year;

// Перевірка відображення слова рік, відповідно до числа

if (age % 10 === 1 && age % 100 !== 11) {
    year = 'рік'
}   else if ((age % 10 >= 2 && age % 10 <= 4) && (age % 100 < 10 || age % 100 >= 20)) {
    year = 'роки'
} else {
    year = 'років'
}

// Перевірка введення числового значення
if (isNaN(age)) {
    alert('Введіть числове значення у поле!');
} else {

}

// Перевірка пустого поля
if (age === '')  {
    alert('Введіть дані у поле');
} else {

}

// Перевірка введення 0 або від'ємного числа
if (age <= 0) {
    alert('Введіть коректний вік')
} else {
    alert(`Ваш вік ${age} ${year}`)
}
